---
kind: method
id: M:Autodesk.Revit.DB.Electrical.WireMaterialTypeSetIterator.#ctor
source: html/658e86d9-300f-6ec6-23d8-316575403999.htm
---
# Autodesk.Revit.DB.Electrical.WireMaterialTypeSetIterator.#ctor Method

For Internal Use Only.

## Syntax (C#)
```csharp
public WireMaterialTypeSetIterator()
```

## Remarks
This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.